<?xml version='1.0'?>
<mission>
	<explanation hasInstruction="true">
		<page type="goal">
		<![CDATA[
        As vari&#225;veis n&#227;o est&#227;o limitadas ao que anotastes na primeira vez. Numa vari&#225;vel que anotastes o pedido 
        podes depois colocar o produto que retirastes do mostrador ou do refrigerador. Essas vari&#225;veis podem ser 
        reaproveitadas. Mas lembra-te: quando se coloca um novo valor numa vari&#225;vel, perde-se o anterior. 
		]]>
		</page>
		
		<page type="goal">
		<![CDATA[
		Neste desafio os tr&#234;s clientes t&#234;m fome e sede. Se resolveres dentro de 6 minutos, ganhas ainda no m&#237;nimo 30 <img style='vertical-align: middle;' src="images/coin2.png"/>.<br/>
		<br/>
		<span style="color:red">Atende todos os clientes com apenas duas vari&#225;veis.</span> 
		]]>
		</page>

<page type="instruction">
		<![CDATA[
		<div class="ExplainContent">
<div class="ExplainContentInternal">
<b>Vari&#225;veis</b><br/>
		Chamamos aten&#231;&#227;o v&#225;rias vezes sobre o cuidado de perder o valor anterior da vari&#225;vel. Se deseja guardar mais de um valor, a solu&#231;&#227;o &#233; ter duas vari&#225;veis. 
		<br/><br/>
		Entretanto, se o valor da vari&#225;vel n&#227;o ser&#225; mais usado, ent&#227;o pode-se aproveitar a mesma vari&#225;vel para colar novos valores.
		Contudo, &#233; uma boa pr&#225;tica termos cuidados com os nomes das vari&#225;veis. Se voc&#234; batizou a vari&#225;vel de <i>pedidoComida</i>, &#233; porque querias guardar os pedidos
		de comida dos clientes. N&#227;o seria uma boa decis&#227;o se voc&#234; reutilizar essa vari&#225;vel para guardar bebidas, pois comprometer&#225; a leitura do programa deixando a confusa. 
		Por exemplo, voc&#234; adicionar um bloco para buscar uma bebida no refrigerador onde o nome da vari&#225;vel &#233; <i>pedidoComida</i>.  
		</div></div>
		]]>
		</page>

	</explanation>
	<hints>
		<sequence>
			<hint category="Iddle" modal="true"  time="0" condition = "Hints.showedHint() == false &amp;&amp; Hints.countShowedIddle() &lt; 1 &amp;&amp; Hints.countInstructions() > 25">
			<![CDATA[
			Se est&#225; complicado de organizar os blocos, tens mais uma alternativa: usar os recursos de zoom da ferramenta. Observe os bot&#245;es acima da lixeira 
			que permitem gerir o zoom da &#225;rea de trabalho.
			]]>
			</hint>

			<hint category="Iddle" modal="true"  condition = "Hints.showedHint() == false &amp;&amp; Hints.howManyRuns() &gt; 10">
			<![CDATA[
			Como podes ter somente duas vari&#225;veis nessa miss&#227;o, vais usar uma para anotar o pedido de comida e outro de bebida da cada cliente.
			Ou seja, atenda UM cliente por vez. Atenda o primeiro cliente, pergunte o que ele deseja comer e beber, e traga os pedidos dele. Depois, selecione todos 
			os blocos mantendo a tecla SHIFT pressionada, copie (CTRL+C) e cole (CTRL+V) e altere para os clientes nas posi&#231;&#245;es 2 e 3.
			]]>
			</hint>
		</sequence>
	</hints>
	<commands>
		<category name="snackMan" show="true"/>
		
		<category name="goToBarCounter" show="true"/>
		<category name="askForFood" show="true" />
		<category name="goToDisplay" show="true" />
		<category name="pickUpHotDog" show="true" />

		<category name="askForDrink" show="true" />
		<category name="goToCooler" show="true" />
		<category name="pickUpDrink" show="true" />

		<category name="deliver" show="true" />
		

		<category name="vars" show="true" />

	</commands>
	<cooker>initial</cooker>
	<customers>
		<customer>
			<id>01</id>
			<init>counter1</init>
			<dest>counter1</dest>
			<orders>
				<order>
					<foods>
						<food qt="1" price="0">hotdog</food>
					</foods>
					<drinks>
						<drink qt="1" price="0">coke</drink>
					</drinks>
				</order>
			</orders>			
		</customer>
		<customer>
			<id>02</id>
			<init>counter2</init>
			<dest>counter2</dest>
			<orders>
				<order>
					<foods>
						<food qt="1" price="0">hotdog</food>
					</foods>
					<drinks>
						<drink qt="1" price="0">coke</drink>
					</drinks>
				</order>
			</orders>	
		</customer>
		<customer>
			<id>03</id>
			<init>counter3</init>
			<dest>counter3</dest>
			<orders>
				<order>
					<foods>
						<food qt="1" price="0">hotdog</food>
					</foods>
					<drinks>
						<drink qt="1" price="0">coke</drink>
					</drinks>
				</order>
			</orders>	
		</customer>
	</customers>
	<objectives ordered="false" xpIndividual="40" xpFinal="20" xpTotalTime="1140" bonusTime="600" bonusTimeReward="90 60 30" varQtd="2" xpTotalRun="6">
		<objective pos="1" place="counter">deliver</objective>
		<objective pos="2" place="counter">deliver</objective>
		<objective pos="3" place="counter">deliver</objective>
	</objectives>
	<xml preload="10">
	</xml>
</mission>

